OdCmEntityColor.mLUT
\details
Maps the colors between ACI values and RGB values.

OdCmEntityColor.m_RGBM
\details
The combined value of the color method and color components.
\sa
Methods of the Color Definition

OdCmEntityColor.lookUpACI(System.Byte,System.Byte,System.Byte)
\details
Converts the RGB value specified by the red, green, and blue components to an
ACI value.
\param red   [in]  Red component an an integer value in the range from 0 to 255.
\param green [in]  Green component an an integer value in the range from 0 to 255.
\param blue  [in]  Blue component an an integer value in the range from 0 to 255.
\remarks
For converting, this method uses the default palette specified by the mLUT
static array and returns the color index without color method as an integer
value in the range from 0 to 257.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-valueColor Functionality as an ACI-value

OdCmEntityColor.lookUpRGB(System.Byte)
\details
Converts the color method from ACIcolorMethod to ColorMethod and assumes the
current color method is ACIcolorMethod.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Color Functionality as an ACI-value
\details
Converts the specified color index (ACI value) to an RGB value.
\remarks
For converting, this method uses the default palette specified by the mLUT static array
and returns the RGB value without color method as a packed integer value in which:
ByteDescription
0              Blue component.
1              Green component.
2              Red component.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-valueColor Functionality as an ACI-value

OdCmEntityColor.setTrueColor(System.UInt32!System.Runtime.CompilerServices.IsLong*)
\details
Returns the TrueColor value of the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Working with Colors and Transparency
\details
Converts the color method from ACIcolorMethod to ColorMethod and returns the ColorMethod value.
\param aciColorMethod [in]  ACIcolorMethod value.
\remarks
Assumes the current color method is ACIcolorMethod.
\sa
Color Functionality as an ACI-value
\details
Sets the color of the calling entity with the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Working with Colors and Transparency

OdCmEntityColor.isNone(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is None (invisible) for the entity color
object and returns true if and only if the color method is set to kNone or
was set to kACInone, otherwise it returns false.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByDgnIndex(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is byDgnIndex for the entity color object
and returns true if and only if the color method is set to kByDgnIndex,
otherwise it returns false.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isForeground(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is Foreground for the entity color object
and returns true if and only if the color method is set to kForeground or
was set to kACIforeground, otherwise it returns false.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByACI(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is byACI for the entity color object and
returns true if and only if the color method is set to kByACI, otherwise it
returns false.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\remarks
This method returns true for ACI values of 0 (ByBlock), 7 (ByForeground),
256 (ByLayer), and 257 (None).
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByBlock(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is byBlock for the entity color object and
returns true if and only if the color method is set to kByBlock, otherwise
it returns false.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByLayer(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is byLayer for the entity color object and
returns true if and only if the color method is set to kByLayer or
kACIbyLayer, otherwise it returns false.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByColor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the color method is byColor for the entity color object and
returns true if and only if the color method is set to kByColor, otherwise
it returns false.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.blue(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the blue color component of the entity color object as a value in
the range from 0 to 255.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-value

OdCmEntityColor.green(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the green color component of the entity color object as a value in
the range from 0 to 255.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-value

OdCmEntityColor.red(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the red color component of the entity color object as a value in the
range from 0 to 255.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-value

OdCmEntityColor.setBlue(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.Byte)
\details
Sets the blue color component for the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\param blue  [in]  Blue component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.setGreen(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.Byte)
\details
Sets the green color component for the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\param green [in]  Green component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.setRed(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.Byte)
\details
Sets the red color component for the entity color object.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\param red   [in] Red component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.setRGB(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.Byte,System.Byte,System.Byte)
\details
Sets the red, green, and blue color components and the color method to byColor
for the entity color object.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\param red   [in] Red component as an integer value in the range from 0 to 255.
\param green [in] Green component as an integer value in the range from 0 to 255.
\param blue  [in] Blue component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.colorIndex(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the color index (ACI) of the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\remarks
The color index can be one of the following:
NameValueDescription
kACIbyBlock       0               Sets the color method to byBlock.
kACIRed           1               Red.
kACIYellow        2               Yellow.
kACIGreen         3               Green.
kACICyan          4               Cyan.
kACIBlue          5               Blue.
kACIMagenta       6               Magenta.
kACIforeground    7               Sets the color method to Foreground.
..                8-255           Defined by display device.
kACIbyLayer       256             Sets the color method to byLayer.
kACInone          257             Sets the color method to None.
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an ACI-value

OdCmEntityColor.setDgnColorIndex(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.Int16)
\details
Sets the .dgn color index (DgnIndex) of a color palette and sets the
color method to byDgnIndex for the entity color object.
\param pRGBM [in] Pointer to the m_RGBM member of the entity color object.
\param colorIndex [in] An integer value that is the index of the color in a palette.

OdCmEntityColor.setColorIndex(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.Int16)
\details
Sets the color index (ACI) of a color palette and sets the color method
to byACI for the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\param colorIndex [in]  An integer value that is the index of the color in a palette.
\remarks
The color index can be one of the following:
NameValueDescription
kACIbyBlock       0               Sets the color method to byBlock.
kACIRed           1               Red.
kACIYellow        2               Yellow.
kACIGreen         3               Green.
kACICyan          4               Cyan.
kACIBlue          5               Blue.
kACIMagenta       6               Magenta.
kACIforeground    7               Sets the color method to Foreground.
..                8-255           Defined by display device.
kACIbyLayer       256             Sets the color method to byLayer.
kACInone          257             Sets the color method to None.
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an ACI-value

OdCmEntityColor.color(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the packed 32-bit integer value that stores the color method and
color components of the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an Integer-value

OdCmEntityColor.setColor(System.UInt32!System.Runtime.CompilerServices.IsLong*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the color method and color components for the entity color object as an
integer value.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\param color [in]  A packed 32-bit integer value that specifies the color method and color components.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an Integer-value

OdCmEntityColor.colorMethod(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*)
\details
Returns the color method of the entity color object as a value of the ColorMethod enumeration.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.setColorMethod(System.UInt32!System.Runtime.CompilerServices.IsLong*,OdCmEntityColor.ColorMethod)
\details
Converts the color method from ACIcolorMethod to ColorMethod and returns the
ColorMethod value.
\remarks
Assumes the current color method is ACIcolorMethod.
\sa
Color Functionality as an ACI-value
\details
Converts the color method from ACIcolorMethod to ColorMethod and
assumes the current color method is ACIcolorMethod.
\sa
Color Functionality as an ACI-value
\details
Sets the color method for the entity color object.
\param pRGBM [in]  Pointer to the m_RGBM member of the entity color object.
\param colorMethod [in]  color method as the ColorMethod enumeration.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.setTrueColor
\details
Returns the TrueColor value of the entity color object.
\sa
Working with Colors and Transparency
\details
Sets the color of the calling entity with the entity color object.
\sa
Working with Colors and Transparency

OdCmEntityColor.isNone
\details
Checks whether the color method is None (invisible) for the entity color
object.
\returns
True if and only if the color method is set to kNone or kACInone, otherwise
returns false.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByDgnIndex
\details
Checks whether the color method is byDgnIndex for the entity color object
and returns true if and only if the color method is set to kByDgnIndex,
otherwise it returns false.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isForeground
\details
Checks whether the color method is Foreground for the entity color object
and returns true if and only if the color method is set to kForeground or
was set to kACIforeground, otherwise it returns false.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByACI
\details
Checks whether the color method is byACI for the entity color object and
returns true if and only if the color method is set to kByACI, otherwise it
returns false.
\remarks
This method returns true for ACI values of 0 (ByBlock), 7 (ByForeground),
256 (ByLayer), and 257 (None).
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByBlock
\details
Checks whether the color method is byBlock for the entity color object and
returns true if and only if the color method is set to kByBlock or was set
to kACIbyBlock, otherwise it returns false.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByLayer
\details
Checks whether the color method is byLayer for the entity color object and
returns true if and only if the color method is set to kByLayer or was set
to kACIbyLayer, otherwise it returns false.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.isByColor
\details
Checks whether the color method is byColor for the entity color object and
returns true if and only if the color method is set to kByColor, otherwise
it returns false.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.blue
\details
Returns the blue color component of the entity color object as a value in
the range from 0 to 255.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-value

OdCmEntityColor.green
\details
Returns the green color component of the entity color object as a value in
the range from 0 to 255.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-value

OdCmEntityColor.red
\details
Returns the red color component of the entity color object as a value in the
range from 0 to 255.
\sa
Example of Working with the Entity ColorColor Functionality as an RGB-value

OdCmEntityColor.setBlue(System.Byte)
\details
Sets the blue color component for the entity color object.
\param blue [in] Blue component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.setGreen(System.Byte)
\details
Sets the green color component for the entity color object.
\param green [in] Green component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.setRed(System.Byte)
\details
Sets the red color component for the entity color object.
\param red [in] Red component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.setRGB(System.Byte,System.Byte,System.Byte)
\details
Sets the red, green, and blue color components and the color method to byColor
for the entity color object.
\param red   [in] Red component as an integer value in the range from 0 to 255.
\param green [in] Green component as an integer value in the range from 0 to 255.
\param blue  [in] Blue component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmEntityColor.colorIndex
\details
Returns the color index (ACI) of the entity color object.
\remarks
The color index can be one of the following:
NameValueDescription
kACIbyBlock       0               Sets the color method to byBlock.
kACIRed           1               Red.
kACIYellow        2               Yellow.
kACIGreen         3               Green.
kACICyan          4               Cyan.
kACIBlue          5               Blue.
kACIMagenta       6               Magenta.
kACIforeground    7               Sets the color method to Foreground.
..                8-255           Defined by display device.
kACIbyLayer       256             Sets the color method to byLayer.
kACInone          257             Sets the color method to None.
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an ACI-value

OdCmEntityColor.setColorIndex(System.Int16)
\details
Sets the color index (ACI) of a color palette and sets the color method
to byACI for the entity color object.
\param colorIndex [in]  An integer value that is the index of the color in a palette.
\remarks
The color index can be one of the following:
NameValueDescription
kACIbyBlock       0               Sets the color method to byBlock.
kACIRed           1               Red.
kACIYellow        2               Yellow.
kACIGreen         3               Green.
kACICyan          4               Cyan.
kACIBlue          5               Blue.
kACIMagenta       6               Magenta.
kACIforeground    7               Sets the color method to Foreground.
..                8-255           Defined by display device.
kACIbyLayer       256             Sets the color method to byLayer.
kACInone          257             Sets the color method to None.
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an ACI-value

OdCmEntityColor.color
\details
Returns the packed 32-bit integer value that stores the color method and
color components of the entity color object.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an Integer-value

OdCmEntityColor.setColor(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the color method and color components for the entity color object as an
integer value.
\param color [in]  A packed 32-bit integer value that specifies the color
method and color components.
\sa
Example of Working with the Entity ColorMethods of the Color DefinitionColor Functionality as an Integer-value

OdCmEntityColor.colorMethod
\details
Returns the color method of the entity color object as a value of the ColorMethod enumeration.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.setColorMethod(OdCmEntityColor.ColorMethod)
\details
Sets the color method for the entity color object.
\param colorMethod [in]  color method as the ColorMethod enumeration.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
An entity does not have a color from the time it is first instantiated until
it is assigned one or added to a database.
\sa
Example of Working with the Entity ColorMethods of the Color Definition

OdCmEntityColor.op_Inequality(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares two entity color objects as integer values, and returns true when
their values are not equal or false when their values are equal.
\sa
Example of Working with the Entity ColorColor Functionality as an Integer-value

OdCmEntityColor.op_Equality(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copies an entity color object specified on the right of the operator to the entity color
object specified on the left.
\sa
Example of Working with the Entity Color
\details
Compares two entity color objects as integer values, and returns true when
their values are equal or false when their values are not equal.
\sa
Example of Working with the Entity ColorColor Functionality as an Integer-value

OdCmEntityColor.#ctor(System.Byte,System.Byte,System.Byte)
\details
Creates an entity color object and sets the red, green and blue color
components and the color method to byColor for the newly created entity
color object.
\param red   [in] Red component.
\param green [in] Green component.
\param blue  [in] Blue component.
\sa
Color Functionality as an RGB-value

OdCmEntityColor.#ctor(OdCmEntityColor.ColorMethod)
\details
Creates a copy of an existing entity color object.
\param color [in]  The entity color object to be copied.
\details
Creates an entity color object and sets the specified color method for the
newly created entity color object.
\param colorMethod [in]  Color method.
\sa
Methods of the Color Definition

OdCmEntityColor.#ctor
\details
Creates an entity color object with default properties.
\remarks
Default ColorMethod is kByColor.

OdCmEntityColor.RGBM
\details
Represents the combined value of the color and color method.
\sa
Methods of the Color Definition